app/controllers/api/v1/books_controller.rb

    def index
        books = Book.all
---
SELECT "books".* FROM "books"