app/controllers/api/v1/clubbooks_controller.rb

    def index
        clubbooks = Clubbook.all
---
SELECT "clubbooks".* FROM "clubbooks"