app/controllers/api/v1/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
    def index
        clubs = Club.all

INSERT INTO "clubs" ("description", "genre", "owner_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        club = Club.create!(club_params)