app/controllers/api/v1/meetings_controller.rb

    def index
        meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

    def create
        meeting = Meeting.create!(meeting_params)
---
INSERT INTO "meetings" ("club_id", "zoom", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["club_id", 1], ["zoom", "zoom.com/link"], ["description", "going over ch1"], ["created_at", "2021-02-10 02:41:19.347056"], ["updated_at", "2021-02-10 02:41:19.347056"]]