app/controllers/api/v1/memberships_controller.rb

    def index
        memberships = Membership.all
---
SELECT "memberships".* FROM "memberships"

    def create
        membership = Membership.create!(membership_params)
---
INSERT INTO "memberships" ("user_id", "club_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["club_id", 4], ["created_at", "2021-02-09 07:00:22.676518"], ["updated_at", "2021-02-09 07:00:22.676518"]]