app/controllers/api/v1/reviews_controller.rb

    def create
        review = Review.create!(review_params)
---
INSERT INTO "reviews" ("book_id", "user_id", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_id", 1], ["user_id", 5], ["review", "test!"], ["created_at", "2021-02-09 22:57:39.943652"], ["updated_at", "2021-02-09 22:57:39.943652"]]

    def show
        review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        review = Review.find(params[:id])
        review.update(review: params[:review])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "review" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["review", "it was ok i guess"], ["updated_at", "2021-02-10 20:24:58.912340"], ["id", 2]]

    def destroy
        review = Review.find(params[:id])
        review.destroy!
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]